In [71]:
import pandas as pd
import numpy as np

In [72]:
sales = pd.read_csv(r'train.csv\sales_dataset_cleaned.csv')
online = pd.read_csv(r'C:\Users\aksh2\OneDrive\Desktop\DBMS Project\OnlineRetail\Retail.csv',encoding='latin1')
calendar = pd.read_csv(r'm5-forecasting-accuracy\calendar.csv')
sell_prices = pd.read_csv(r'm5-forecasting-accuracy\sell_prices.csv')
sales_val = pd.read_csv(r'm5-forecasting-accuracy\sales_train_validation.csv')
sales_eval = pd.read_csv(r'm5-forecasting-accuracy\sales_train_evaluation.csv')

In [73]:
sales.head()

    sale_date  store_id  product_id  quantity_sold  revenue
0  2013-01-01         1           1             13     19.5
1  2013-01-02         1           1             11     16.5
2  2013-01-03         1           1             14     21.0
3  2013-01-04         1           1             13     19.5
4  2013-01-05         1           1             10     15.0

In [74]:
online.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [75]:
calendar.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [76]:
sell_prices.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [77]:
sales_val.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
0,HOBBIES_1_001_CA_1_validation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,3,0,1,1,1,3,0,1,1
1,HOBBIES_1_002_CA_1_validation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,HOBBIES_1_003_CA_1_validation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,1,2,1,1,1,0,1,1,1
3,HOBBIES_1_004_CA_1_validation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,5,4,1,0,1,3,7,2
4,HOBBIES_1_005_CA_1_validation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,1,1,0,1,1,2,2,2,4

In [78]:
sales_eval.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [79]:
sales.info()
sales['sale_date'] = pd.to_datetime(sales['sale_date'])
sales = sales.sort_values(by=['product_id','sale_date'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 913000 entries, 0 to 912999
Data columns (total 5 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   sale_date      913000 non-null  object
 1   store_id       913000 non-null  int64
 2   product_id     913000 non-null  int64
 3   quantity_sold  913000 non-null  int64
 4   revenue        913000 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 34.8+ MB

In [80]:
sales['day_of_week'] = sales['sale_date'].dt.weekday
sales['week_of_year'] = sales['sale_date'].dt.isocalendar().week.astype(int)
sales['month'] = sales['sale_date'].dt.month
sales['is_weekend'] = sales['day_of_week'].isin([5,6]).astype(int)

In [81]:
LAGS = [1,7,14,28]
for lag in LAGS:
    sales[f'lag_{lag}'] = (
        sales.groupby('product_id')['quantity_sold'].shift(lag))

In [82]:
WINDOWS = [7, 14, 30]

for window in WINDOWS:
    sales[f"rolling_{window}_mean"] = (
        sales.groupby("product_id")["quantity_sold"]
        .shift(1)
        .rolling(window)
        .mean()
    )

In [83]:
online = online[
    (online["Quantity"] > 0) &
    (online["UnitPrice"] > 0)
]

online["InvoiceDate"] = pd.to_datetime(online["InvoiceDate"])

In [84]:
online_features = (
    online.groupby("StockCode")
    .agg(
        avg_qty_per_order=("Quantity", "mean"),
        total_units_sold=("Quantity", "sum"),
        qty_std=("Quantity", "std"),
        avg_unit_price=("UnitPrice", "mean"),
        price_std=("UnitPrice", "std"),
        unique_customers=("CustomerID", "nunique")
    )
    .reset_index()
    .rename(columns={"StockCode": "product_id"})
)

In [85]:
global_online_features = {
    "global_avg_qty_per_order": online["Quantity"].mean(),
    "global_qty_std": online["Quantity"].std(),
    "global_avg_unit_price": online["UnitPrice"].mean(),
    "global_price_std": online["UnitPrice"].std(),
    "global_unique_customers": online["CustomerID"].nunique()
}

In [86]:
for col, val in global_online_features.items():
    sales[col] = val

In [87]:
sales.head()

,sale_date,store_id,product_id,quantity_sold,revenue,day_of_week,week_of_year,month,is_weekend,lag_1,...,lag_14,lag_28,rolling_7_mean,rolling_14_mean,rolling_30_mean,global_avg_qty_per_order,global_qty_std,global_avg_unit_price,global_price_std,global_unique_customers
0,2013-01-01,1,1,13,19.5,1,1,1,0,NaN,...,NaN,NaN,NaN,NaN,NaN,10.542037,155.524124,3.907625,35.915681,4338
1826,2013-01-01,2,1,12,18.0,1,1,1,0,13.0,...,NaN,NaN,NaN,NaN,NaN,10.542037,155.524124,3.907625,35.915681,4338
3652,2013-01-01,3,1,19,28.5,1,1,1,0,12.0,...,NaN,NaN,NaN,NaN,NaN,10.542037,155.524124,3.907625,35.915681,4338
5478,2013-01-01,4,1,10,15.0,1,1,1,0,19.0,...,NaN,NaN,NaN,NaN,NaN,10.542037,155.524124,3.907625,35.915681,4338
7304,2013-01-01,5,1,11,16.5,1,1,1,0,10.0,...,NaN,NaN,NaN,NaN,NaN,10.542037,155.524124,3.907625,35.915681,4338

In [88]:
calendar = calendar[[
    "date", "wm_yr_wk", "event_name_1", "event_type_1", "snap_CA", "snap_TX", "snap_WI"
]]

calendar["date"] = pd.to_datetime(calendar["date"])

calendar["is_event"] = calendar["event_name_1"].notna().astype(int)
calendar["is_snap"] = (
    calendar[["snap_CA", "snap_TX", "snap_WI"]].max(axis=1)
)

In [89]:
sales = sales.merge(
    calendar[["date", "wm_yr_wk", "is_event", "is_snap"]],
    left_on="sale_date",
    right_on="date",
    how="left"
)

sales.drop(columns=["date"], inplace=True)

In [90]:
sell_prices = sell_prices.rename(columns={"item_id": "product_id"})

In [102]:
sales["global_avg_price"] = sell_prices["sell_price"].mean()
sales["global_price_std"] = sell_prices["sell_price"].std()
sales["global_price_volatility"] = (
    sell_prices["sell_price"].std() /
    sell_prices["sell_price"].mean()
)

In [103]:
sales["target"] = (
    sales.groupby("product_id")["quantity_sold"].shift(-1)
)

In [104]:
final_df = sales.dropna().reset_index(drop=True)

In [105]:
print(final_df.shape)
final_df.head()

(631500, 29)

,sale_date,store_id,product_id,quantity_sold,revenue,day_of_week,week_of_year,month,is_weekend,lag_1,...,global_price_std,global_unique_customers,wm_yr_wk,is_event,is_snap,global_avg_price,global_min_price,global_max_price,global_price_volatility,target
0,2013-01-04,1,1,13,19.5,4,1,1,0,16.0,...,3.408814,4338,11249.0,0.0,1.0,4.410952,0.01,107.32,0.772807,20.0
1,2013-01-04,2,1,20,30.0,4,1,1,0,13.0,...,3.408814,4338,11249.0,0.0,1.0,4.410952,0.01,107.32,0.772807,15.0
2,2013-01-04,3,1,15,22.5,4,1,1,0,20.0,...,3.408814,4338,11249.0,0.0,1.0,4.410952,0.01,107.32,0.772807,15.0
3,2013-01-04,4,1,15,22.5,4,1,1,0,15.0,...,3.408814,4338,11249.0,0.0,1.0,4.410952,0.01,107.32,0.772807,8.0
4,2013-01-04,5,1,8,12.0,4,1,1,0,15.0,...,3.408814,4338,11249.0,0.0,1.0,4.410952,0.01,107.32,0.772807,7.0

In [106]:
final_df.to_csv("final_ml_dataset.csv", index=False)